
/* Strings for login panel. See Keychain.cpp. */

"kLoginTitle" = "Käytä RSS-syötettä syöttämällä nimi ja salasana.";
"kLoginInitialMessage"      = "Voit käyttää RSS-syötettä ”%@” kirjautumalla alueelle ”%@” sijainnissa %@. Salasana lähetetään salaamattomassa muodossa.";
"kLoginFailedMessage"       = "Kirjautuminen epäonnistui. Syötä käyttäjätunnus ja salasana uudelleen alueelle ”%@” sijainnissa %@.\n";
"kLoginUsernameField"       = "Käyttäjätunnus:";
"kLoginPasswordField"       = "Salasana:";
"kLoginLogInButton"         = "Kirjaudu sisään";
"kLoginCancelButton"        = "Kumoa";
"kLoginSavePasswordCheckbox"= "Muista salasana avainnipussa";


/* Error Messages */

"PSInternalErrorDescription"        = "Publication Subscription -sovelluskehyksessä tapahtui sisäinen virhe.";
"PSInternalErrorFailureReason"      = "Publication Subscription -sovelluskehyksessä tapahtui sisäinen virhe.";
"PSInternalErrorRecoverySuggestion" = "Kirjaudu ulos ja yritä uudelleen.";

"PSNotAFeedErrorDescription"        = "Syötettä ei voitu päivittää, koska sisältö ei ole tunnetussa syötemuodossa.";
"PSNotAFeedErrorFailureReason"      = "Sisältö ei ole tunnetussa syötemuodossa.";
"PSNotAFeedErrorRecoverySuggestion" = "Varmista, että määritetty sijainti sisältää Atom- tai RSS-muotoisen syötteen.";

"NSURLErrorUserAuthenticationRequired Description" = "Käyttäjätunnus ja salasana vaaditaan";

/* Localized date/time formats. See DateClass.cpp */

"TodayFmt"      = "'Tänään', H.mm";
"YesterdayFmt"  = "'Eilen', H.mm";
"ThisWeekFmt"   = "EEEE, HH.mm";
"ThisYearFmt"   = "d. MMM, HH.mm";
"PastYearFmt"   = "d. MMM yyyy, HH.mm";

/* Localizable file size formatters.  See StringClass::representationForBytes */

"0 bytes"            = "0 tavua";           /* String used for showing a zero byte size */
"1 byte"             = "1 tavu";            /* String used for showing a one byte size */
"%.0f bytes"         = "%.0f tavua";        /* Format used to display a size between 2 and 100 bytes */
"%.1f KB (0.1)"      = "%.1f kt";           /* Format used to display sizes between 100 and 999 bytes */
"%.1f KB (1.0)"      = "%.1f kt";           /* Format used to display sizes between 1000 bytes and 9.9 KB */
"%.1f KB (10.0)"     = "%.1f kt";           /* Format used to display sizes between 10 and 99.9 KB */
"%.0f KB"            = "%.0f kt";           /* Format used to display sizes between 100 and 999 KB */
"%.1f MB (1.0)"      = "%.1f Mt";           /* Format used to display sizes between 1000 KB and 9.9 MB */
"%.1f MB (10.0)"     = "%.1f Mt";           /* Format used to display sizes between 10 and 99.9 MB */
"%.0f MB"            = "%.0f Mt";           /* Format used to display sizes between 100 and 999 MB */
"%.1f GB (1.0)"      = "%.2f Gt";           /* Format used to display sizes between 1000 MB and 9.9 GB */
"%.1f GB (10.0)"     = "%.2f Gt";           /* Format used to display sizes between 10 and 99.9 GB */
"%.0f GB"            = "%.0f Gt";           /* Format used to display sizes 100 GB or greater */

/* Localizable file names. Currently only used in EnclosureCore.cpp */

"kUntitledFileName" = "Nimetön";   /* If we download and enclosure for which we have no other name to go by */
